In [ ]:
!pip install reverse_geocode

In [188]:
import pandas.io.sql as psql
from ipywidgets import interact  ##-- Interactors
import ipywidgets as widgets     #---
from sqlalchemy import create_engine, text
import pandas as pd

############## Conectar com um servidor SQL na Base postgres ###################### --> Postgres.postgres
%reload_ext sql

# Connection format: %sql dialect+driver://username:password@host:port/database
engine = create_engine('postgresql://postgres:dwightDW@localhost:5455/furacaodw')
%sql postgresql://postgres:dwightDW@localhost:5455/furacaodw
%sql SET client_encoding = 'latin1'

%sql DB << SELECT Current_Database();
print(DB)

 * postgresql://postgres:***@localhost:5455/furacaodw
Done.
 * postgresql://postgres:***@localhost:5455/furacaodw
1 rows affected.
Returning data to local variable DB
+------------------+
| current_database |
+------------------+
|    furacaodw     |
+------------------+

## Extract

### Furacão

In [189]:
hur_a = pd.read_csv("hurricane/atlantic.csv")
hur_p = pd.read_csv("hurricane/pacific.csv")
hur_a.head()

,ID,Name,Date,Time,Event,Status,Latitude,Longitude,Maximum Wind,Minimum Pressure,...,Low Wind SW,Low Wind NW,Moderate Wind NE,Moderate Wind SE,Moderate Wind SW,Moderate Wind NW,High Wind NE,High Wind SE,High Wind SW,High Wind NW
0,AL011851,UNNAMED,18510625,0,,HU,28.0N,94.8W,80,-999,...,-999,-999,-999,-999,-999,-999,-999,-999,-999,-999
1,AL011851,UNNAMED,18510625,600,,HU,28.0N,95.4W,80,-999,...,-999,-999,-999,-999,-999,-999,-999,-999,-999,-999
2,AL011851,UNNAMED,18510625,1200,,HU,28.0N,96.0W,80,-999,...,-999,-999,-999,-999,-999,-999,-999,-999,-999,-999
3,AL011851,UNNAMED,18510625,1800,,HU,28.1N,96.5W,80,-999,...,-999,-999,-999,-999,-999,-999,-999,-999,-999,-999
4,AL011851,UNNAMED,18510625,2100,L,HU,28.2N,96.8W,80,-999,...,-999,-999,-999,-999,-999,-999,-999,-999,-999,-999

In [190]:
hur_p.head()

,ID,Name,Date,Time,Event,Status,Latitude,Longitude,Maximum Wind,Minimum Pressure,...,Low Wind SW,Low Wind NW,Moderate Wind NE,Moderate Wind SE,Moderate Wind SW,Moderate Wind NW,High Wind NE,High Wind SE,High Wind SW,High Wind NW
0,EP011949,UNNAMED,19490611,0,,TS,20.2N,106.3W,45,-999,...,-999,-999,-999,-999,-999,-999,-999,-999,-999,-999
1,EP011949,UNNAMED,19490611,600,,TS,20.2N,106.4W,45,-999,...,-999,-999,-999,-999,-999,-999,-999,-999,-999,-999
2,EP011949,UNNAMED,19490611,1200,,TS,20.2N,106.7W,45,-999,...,-999,-999,-999,-999,-999,-999,-999,-999,-999,-999
3,EP011949,UNNAMED,19490611,1800,,TS,20.3N,107.7W,45,-999,...,-999,-999,-999,-999,-999,-999,-999,-999,-999,-999
4,EP011949,UNNAMED,19490612,0,,TS,20.4N,108.6W,45,-999,...,-999,-999,-999,-999,-999,-999,-999,-999,-999,-999

In [191]:
hur_p.columns

Index(['ID', 'Name', 'Date', 'Time', 'Event', 'Status', 'Latitude',
       'Longitude', 'Maximum Wind', 'Minimum Pressure', 'Low Wind NE',
       'Low Wind SE', 'Low Wind SW', 'Low Wind NW', 'Moderate Wind NE',
       'Moderate Wind SE', 'Moderate Wind SW', 'Moderate Wind NW',
       'High Wind NE', 'High Wind SE', 'High Wind SW', 'High Wind NW'],
      dtype='object')

In [192]:
%%sql
DROP TABLE IF EXISTS HURRICANE_RAW;
CREATE TABLE HURRICANE_RAW (
    ID VARCHAR(100),
    NAME VARCHAR(200),
    DATE VARCHAR(50),
    TIME VARCHAR(4),
    EVENT VARCHAR(4),
    STATUS VARCHAR(10),
    LATITUDE VARCHAR(15),
    LONGITUDE VARCHAR(15),
    MAXWIND INTEGER,
    MINPRESSURE INTEGER,
    LOWWIND_NE INTEGER,
    LOWWIND_SE INTEGER,
    LOWWIND_NW INTEGER,
    LOWWIND_SW INTEGER,
    MODWIND_NE INTEGER,
    MODWIND_SE INTEGER,
    MODWIND_NW INTEGER,
    MODWIND_SW INTEGER,
    HIGHWIND_NE INTEGER,
    HIGHWIND_SE INTEGER,
    HIGHWIND_NW INTEGER,
    HIGHWIND_SW INTEGER
);

 * postgresql://postgres:***@localhost:5455/furacaodw
Done.
Done.

[]

In [193]:
%%sql
COPY HURRICANE_RAW( id, name, date, time, event, status, latitude, longitude,
                maxwind, minpressure, lowwind_ne, lowwind_se, lowwind_nw, lowwind_sw,
                modwind_ne, modwind_se, modwind_nw, modwind_sw,
                highwind_ne, highwind_se, highwind_nw, highwind_sw)
FROM '/hurricane/atlantic.csv'
DELIMITER ','
CSV HEADER;

COPY HURRICANE_RAW( id, name, date, time, event, status, latitude, longitude,
                maxwind, minpressure, lowwind_ne, lowwind_se, lowwind_nw, lowwind_sw,
                modwind_ne, modwind_se, modwind_nw, modwind_sw,
                highwind_ne, highwind_se, highwind_nw, highwind_sw)
FROM '/hurricane/pacific.csv'
DELIMITER ','
CSV HEADER;

 * postgresql://postgres:***@localhost:5455/furacaodw
49105 rows affected.
26137 rows affected.

[]

In [194]:
%%sql
SELECT COUNT(*) FROM HURRICANE;

 * postgresql://postgres:***@localhost:5455/furacaodw
1 rows affected.

[(75242,)]

### Temperatura

In [195]:
temp = pd.read_csv("temperature/Environment_Temperature_change_E_All_Data_NOFLAG.csv", encoding='latin-1')
temp.head()

,Area Code,Area,Months Code,Months,Element Code,Element,Unit,Y1961,Y1962,Y1963,...,Y2010,Y2011,Y2012,Y2013,Y2014,Y2015,Y2016,Y2017,Y2018,Y2019
0,2,Afghanistan,7001,January,7271,Temperature change,°C,0.777,0.062,2.744,...,3.601,1.179,-0.583,1.233,1.755,1.943,3.416,1.201,1.996,2.951
1,2,Afghanistan,7001,January,6078,Standard Deviation,°C,1.950,1.950,1.950,...,1.950,1.950,1.950,1.950,1.950,1.950,1.950,1.950,1.950,1.950
2,2,Afghanistan,7002,February,7271,Temperature change,°C,-1.743,2.465,3.919,...,1.212,0.321,-3.201,1.494,-3.187,2.699,2.251,-0.323,2.705,0.086
3,2,Afghanistan,7002,February,6078,Standard Deviation,°C,2.597,2.597,2.597,...,2.597,2.597,2.597,2.597,2.597,2.597,2.597,2.597,2.597,2.597
4,2,Afghanistan,7003,March,7271,Temperature change,°C,0.516,1.336,0.403,...,3.390,0.748,-0.527,2.246,-0.076,-0.497,2.296,0.834,4.418,0.234

In [196]:
%%sql
DROP TABLE IF EXISTS TEMPERATURE_RAW;
CREATE TABLE TEMPERATURE_RAW (
    AREA_CODE INTEGER,
    AREA VARCHAR(100),
    MONTHS_CODE INTEGER,
    MONTHS VARCHAR(50),
    ELEMENT_CODE INTEGER,
    ELEMENT VARCHAR(100),
    UNIT VARCHAR(10),
    Y1961 REAL,
    Y1962 REAL,
    Y1963 REAL,
    Y1964 REAL,
    Y1965 REAL,
    Y1966 REAL,
    Y1967 REAL,
    Y1968 REAL,
    Y1969 REAL,
    Y1970 REAL,
    Y1971 REAL,
    Y1972 REAL,
    Y1973 REAL,
    Y1974 REAL,
    Y1975 REAL,
    Y1976 REAL,
    Y1977 REAL,
    Y1978 REAL,
    Y1979 REAL,
    Y1980 REAL,
    Y1981 REAL,
    Y1982 REAL,
    Y1983 REAL,
    Y1984 REAL,
    Y1985 REAL,
    Y1986 REAL,
    Y1987 REAL,
    Y1988 REAL,
    Y1989 REAL,
    Y1990 REAL,
    Y1991 REAL,
    Y1992 REAL,
    Y1993 REAL,
    Y1994 REAL,
    Y1995 REAL,
    Y1996 REAL,
    Y1997 REAL,
    Y1998 REAL,
    Y1999 REAL,
    Y2000 REAL,
    Y2001 REAL,
    Y2002 REAL,
    Y2003 REAL,
    Y2004 REAL,
    Y2005 REAL,
    Y2006 REAL,
    Y2007 REAL,
    Y2008 REAL,
    Y2009 REAL,
    Y2010 REAL,
    Y2011 REAL,
    Y2012 REAL,
    Y2013 REAL,
    Y2014 REAL,
    Y2015 REAL,
    Y2016 REAL,
    Y2017 REAL,
    Y2018 REAL,
    Y2019 REAL
)

 * postgresql://postgres:***@localhost:5455/furacaodw
Done.
Done.

[]

In [197]:
%%sql
COPY TEMPERATURE_RAW 
    (AREA_CODE, AREA, MONTHS_CODE, MONTHS, ELEMENT_CODE, ELEMENT, UNIT,
    Y1961, Y1962, Y1963, Y1964, Y1965, Y1966, Y1967, Y1968, Y1969, Y1970,
    Y1971, Y1972, Y1973, Y1974, Y1975, Y1976, Y1977, Y1978, Y1979, Y1980, 
    Y1981, Y1982, Y1983, Y1984, Y1985, Y1986, Y1987, Y1988, Y1989, Y1990, 
    Y1991, Y1992, Y1993, Y1994, Y1995, Y1996, Y1997, Y1998, Y1999, Y2000, 
    Y2001, Y2002, Y2003, Y2004, Y2005, Y2006, Y2007, Y2008, Y2009, Y2010, 
    Y2011, Y2012, Y2013, Y2014, Y2015, Y2016, Y2017, Y2018, Y2019)
FROM '/temperature/Environment_Temperature_change_E_All_Data_NOFLAG.csv'
DELIMITER ','
CSV HEADER;

 * postgresql://postgres:***@localhost:5455/furacaodw
9656 rows affected.

[]

In [198]:
%%sql
DROP TABLE IF EXISTS COUNTRIES;
CREATE TABLE COUNTRIES (
    ID INTEGER,
    COUNTRY VARCHAR(200)
);
COPY COUNTRIES (id, country)
FROM '/countries.csv'
DELIMITER ','
CSV HEADER;

 * postgresql://postgres:***@localhost:5455/furacaodw
Done.
Done.
241 rows affected.

[]

## Criando tabelas reais

##### Tabela Localização

In [199]:
%%sql
DROP TABLE IF EXISTS LOCALIZACAO;
CREATE TABLE LOCALIZACAO (
    CHAVE_LOCALIZACAO SERIAL NOT NULL,
    PAIS VARCHAR(100),
    AREA_CODE INTEGER,
    CONTINENTE VARCHAR(100),
    CONSTRAINT PK_LOCALIZACAO PRIMARY KEY (CHAVE_LOCALIZACAO)
);

 * postgresql://postgres:***@localhost:5455/furacaodw
Done.
Done.

[]

#### Tabela DataView

In [200]:
%%sql
DROP VIEW IF EXISTS DATA_VIEW;
CREATE VIEW DATA_VIEW (
    MES INTEGER,
    MES_ESCRITO VARCHAR(100),
    TRIMESTRE INTEGER,
    SEMESTRE INTEGER,
    ANO INTEGER
);

 * postgresql://postgres:***@localhost:5455/furacaodw
Done.
(psycopg2.errors.SyntaxError) syntax error at or near "INTEGER"
LINE 2:     MES INTEGER,
                ^

[SQL: CREATE VIEW DATA_VIEW (
    MES INTEGER,
    MES_ESCRITO VARCHAR(100),
    TRIMESTRE INTEGER,
    SEMESTRE INTEGER,
    ANO INTEGER
);]
(Background on this error at: https://sqlalche.me/e/20/f405)

### Esquema Estrela Aquecimento

#### Tabela Aquecimento

In [201]:
%%sql
DROP TABLE IF EXISTS AQUECIMENTO;
CREATE TABLE AQUECIMENTO (
    CHAVE_DATA_AQUECIMENTO SERIAL NOT NULL,
    CHAVE_LOCALIZACAO SERIAL NOT NULL,
    DESVIO_PADRAO INTEGER,
    VARIACAO_TEMPERATURA INTEGER,
    CONSTRAINT PK_AQUECIMENTO PRIMARY KEY (CHAVE_DATA_AQUECIMENTO, CHAVE_LOCALIZACAO)
);

 * postgresql://postgres:***@localhost:5455/furacaodw
Done.
Done.

[]

#### Tabela DataAquecimento

In [202]:
%%sql
DROP TABLE IF EXISTS DATA_AQUECIMENTO;
CREATE TABLE DATA_AQUECIMENTO (
    CHAVE_DATA_AQUECIMENTO SERIAL NOT NULL,
    MES INTEGER,
    MES_ESCRITO VARCHAR(100),
    TRIMESTRE INTEGER,
    SEMESTRE INTEGER,
    ANO INTEGER,
    CONSTRAINT PK_DATA_AQUECIMENTO PRIMARY KEY (CHAVE_DATA_AQUECIMENTO)
);

 * postgresql://postgres:***@localhost:5455/furacaodw
Done.
Done.

[]

### Esquema Estrela Furacão

#### Tabela Furacão

In [203]:
%%sql
DROP TABLE IF EXISTS FURACAO;
CREATE TABLE FURACAO (
    CHAVE_DATA_FURACAO SERIAL NOT NULL,
    CHAVE_HORARIO SERIAL NOT NULL,
    CHAVE_STATUS SERIAL NOT NULL,
    CHAVE_IDENTIFICACAO SERIAL NOT NULL,
    CHAVE_LOCALIZACAO SERIAL NOT NULL,
    VELOCIDADE_DO_VENTO INTEGER,
    CATEGORIA VARCHAR(100),
    QUANT_OCORRENCIA INTEGER,
    CONSTRAINT PK_FURACAO PRIMARY KEY (CHAVE_DATA_FURACAO, CHAVE_HORARIO, CHAVE_STATUS, CHAVE_IDENTIFICACAO, CHAVE_LOCALIZACAO)
);

 * postgresql://postgres:***@localhost:5455/furacaodw
Done.
Done.

[]

##### Tabela DataFuracão

In [204]:
%%sql
DROP TABLE IF EXISTS DATA_FURACAO;
CREATE TABLE DATA_FURACAO (
    CHAVE_DATA_FURACAO SERIAL NOT NULL,
    DIA INTEGER,
    MES INTEGER,
    MES_ESCRITO VARCHAR(100),
    TRIMESTRE INTEGER,
    SEMESTRE INTEGER,
    ANO INTEGER,
    CONSTRAINT PK_DATA_FURACAO PRIMARY KEY (CHAVE_DATA_FURACAO)
);

 * postgresql://postgres:***@localhost:5455/furacaodw
Done.
Done.

[]

##### Tabela Horário

In [205]:
%%sql
DROP TABLE IF EXISTS HORARIO;
CREATE TABLE HORARIO (
    CHAVE_HORARIO SERIAL NOT NULL,
    HORA_UTC DATE,
    HORALOCAL DATE,
    CONSTRAINT PK_HORARIO PRIMARY KEY (CHAVE_HORARIO)
);

 * postgresql://postgres:***@localhost:5455/furacaodw
Done.
Done.

[]

#### Tabela Status

In [206]:
%%sql
DROP TABLE IF EXISTS STATUS;
CREATE TABLE STATUS (
    CHAVE_STATUS SERIAL NOT NULL,
    STATUS INTEGER,
    STATUS_ESCRITO VARCHAR(100),
    CONSTRAINT PK_STATUSO PRIMARY KEY (CHAVE_STATUS)
);

 * postgresql://postgres:***@localhost:5455/furacaodw
Done.
Done.

[]

#### Tabela Identificação

In [207]:
%%sql
DROP TABLE IF EXISTS IDENTIFICACAO;
CREATE TABLE IDENTIFICACAO (
    CHAVE_IDENTIFICACAO SERIAL NOT NULL,
    ID INTEGER,
    NOME VARCHAR(100),
    CONSTRAINT PK_IDENTIFICACAO PRIMARY KEY (CHAVE_IDENTIFICACAO)
);

 * postgresql://postgres:***@localhost:5455/furacaodw
Done.
Done.

[]

## Transform

### UNNAMED para NULL

In [208]:
query = """
UPDATE HURRICANE_RAW
SET name = NULL
WHERE name ~ 'UNNAMED'
"""

with engine.connect() as connection:
    result = connection.execute(text(query))
    connection.commit()
    print(
        f"Updated {result.rowcount} row(s) from Hurricane_Raw")

Updated 28743 row(s) from Hurricane_Raw

### Selecionar apenas países

In [209]:
query = """
WITH SELECTED_COUNTRIES AS (
    SELECT DISTINCT COUNTRY
        FROM TEMPERATURE_RAW
            JOIN COUNTRIES ON LOWER(COUNTRY) = LOWER(AREA)
), UNSELECTED_COUNTRIES AS (
    SELECT DISTINCT AREA COUNTRY
        FROM TEMPERATURE_RAW
            LEFT JOIN SELECTED_COUNTRIES ON AREA = COUNTRY
    WHERE COUNTRY IS NULL
)
DELETE FROM TEMPERATURE_RAW temp 
    USING UNSELECTED_COUNTRIES unsel
WHERE temp.area = unsel.country;
"""

with engine.connect() as connection:
    result = connection.execute(text(query))
    connection.commit()
    print(
        f"Deleted {result.rowcount} row(s) from Temperature_Raw")

Deleted 3128 row(s) from Temperature_Raw

In [210]:
query = """
SELECT COUNT(DISTINCT AREA) FROM TEMPERATURE_RAW;
"""

with engine.connect() as connection:
    result = connection.execute(text(query))
    connection.commit()
    for row in result:
        print(row)

(192,)

### Alterar o formato da Latitude e Longitude

In [211]:
%%sql
SELECT
   LATITUDE,
   LONGITUDE,
    
   CASE
      WHEN RIGHT(LATITUDE, 1) = 'N' THEN CAST(SUBSTR(LATITUDE,1, LENGTH(LATITUDE) - 1) AS DECIMAL)
      WHEN RIGHT(LATITUDE, 1) = 'S' THEN -1 * CAST(SUBSTR(LATITUDE,1, LENGTH(LATITUDE) - 1) AS DECIMAL)
   END AS LATITUDE_VALUES,

   CASE
      WHEN RIGHT(LONGITUDE, 1) = 'E' THEN CAST(SUBSTR(LONGITUDE,1, LENGTH(LONGITUDE) - 1) AS DECIMAL)
      WHEN RIGHT(LONGITUDE, 1) = 'W' THEN -1 * CAST(SUBSTR(LONGITUDE,1, LENGTH(LONGITUDE) - 1) AS DECIMAL)
   END AS LONGITUDE_VALUES
     
FROM 
   HURRICANE_RAW
LIMIT 5;

 * postgresql://postgres:***@localhost:5455/furacaodw
5 rows affected.

[('17.1N', '55.5W', Decimal('17.1'), Decimal('-55.5')),
 ('17.7N', '56.3W', Decimal('17.7'), Decimal('-56.3')),
 ('18.2N', '57.4W', Decimal('18.2'), Decimal('-57.4')),
 ('19.0N', '58.6W', Decimal('19.0'), Decimal('-58.6')),
 ('20.0N', '60.0W', Decimal('20.0'), Decimal('-60.0'))]

In [212]:
%%sql
UPDATE HURRICANE_RAW
SET LATITUDE = CASE
                      WHEN RIGHT(LATITUDE, 1) = 'N' THEN CAST(SUBSTR(LATITUDE,1, LENGTH(LATITUDE) - 1) AS DECIMAL)
                      WHEN RIGHT(LATITUDE, 1) = 'S' THEN -1 * CAST(SUBSTR(LATITUDE,1, LENGTH(LATITUDE) - 1) AS DECIMAL)
                   END;
UPDATE HURRICANE_RAW
SET LONGITUDE = CASE 
                      wHEN RIGHT(LONGITUDE, 1) = 'E' THEN CAST(SUBSTR(LONGITUDE,1, LENGTH(LONGITUDE) - 1) AS DECIMAL)
                      WHEN RIGHT(LONGITUDE, 1) = 'W' THEN -1 * CAST(SUBSTR(LONGITUDE,1, LENGTH(LONGITUDE) - 1) AS DECIMAL)
                   END;

 * postgresql://postgres:***@localhost:5455/furacaodw

75242 rows affected.
75242 rows affected.

[]

In [213]:
!pip install reverse_geocode

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: reverse_geocode in /home/kibon/.local/lib/python3.10/site-packages (1.4.1)
Requirement already satisfied: scipy in /home/kibon/.local/lib/python3.10/site-packages (from reverse_geocode) (1.11.3)
Requirement already satisfied: numpy in /home/kibon/.local/lib/python3.10/site-packages (from reverse_geocode) (1.24.2)

In [214]:
%%sql
SELECT * FROM HURRICANE_RAW LIMIT 5;

 * postgresql://postgres:***@localhost:5455/furacaodw
5 rows affected.

[('AL011950', '               ABLE', '19500812', '0', '  ', ' TS', '17.1', '-55.5', 35, -999, -999, -999, -999, -999, -999, -999, -999, -999, -999, -999, -999, -999),
 ('AL011950', '               ABLE', '19500812', '600', '  ', ' TS', '17.7', '-56.3', 40, -999, -999, -999, -999, -999, -999, -999, -999, -999, -999, -999, -999, -999),
 ('AL011950', '               ABLE', '19500812', '1200', '  ', ' TS', '18.2', '-57.4', 45, -999, -999, -999, -999, -999, -999, -999, -999, -999, -999, -999, -999, -999),
 ('AL011950', '               ABLE', '19500812', '1800', '  ', ' TS', '19.0', '-58.6', 50, -999, -999, -999, -999, -999, -999, -999, -999, -999, -999, -999, -999, -999),
 ('AL011950', '               ABLE', '19500813', '0', '  ', ' TS', '20.0', '-60.0', 50, -999, -999, -999, -999, -999, -999, -999, -999, -999, -999, -999, -999, -999)]

### Mudar data do hurricane_raw de string para date

In [215]:
query = """
ALTER TABLE HURRICANE_RAW
ALTER COLUMN date TYPE DATE
USING date::Date
"""

with engine.connect() as connection:
    result = connection.execute(text(query))
    connection.commit()

### Trocar por NULL eventos vazios

In [216]:
query = """
UPDATE HURRICANE_RAW
SET event = NULL
WHERE event ~ 'UNNAMED'
"""

with engine.connect() as connection:
    result = connection.execute(text(query))
    connection.commit()
    print(
        f"Updated {result.rowcount} row(s) from Hurricane_Raw")

Updated 0 row(s) from Hurricane_Raw

### Mudar time do hurricane_raw de string para time

In [227]:
%%sql

UPDATE HURRICANE_RAW
SET time = LPAD(time, 4, '0');

ALTER TABLE HURRICANE_RAW
ALTER COLUMN time TYPE TIME
USING time::TIME;

 * postgresql://postgres:***@localhost:5455/furacaodw
75242 rows affected.
Done.

[]

In [219]:
%%sql
SELECT * FROM HURRICANE_RAW LIMIT 5;

 * postgresql://postgres:***@localhost:5455/furacaodw
5 rows affected.

[('AL011950', '               ABLE', datetime.date(1950, 8, 12), '0', '  ', ' TS', '17.1', '-55.5', 35, -999, -999, -999, -999, -999, -999, -999, -999, -999, -999, -999, -999, -999),
 ('AL011950', '               ABLE', datetime.date(1950, 8, 12), '600', '  ', ' TS', '17.7', '-56.3', 40, -999, -999, -999, -999, -999, -999, -999, -999, -999, -999, -999, -999, -999),
 ('AL011950', '               ABLE', datetime.date(1950, 8, 12), '1200', '  ', ' TS', '18.2', '-57.4', 45, -999, -999, -999, -999, -999, -999, -999, -999, -999, -999, -999, -999, -999),
 ('AL011950', '               ABLE', datetime.date(1950, 8, 12), '1800', '  ', ' TS', '19.0', '-58.6', 50, -999, -999, -999, -999, -999, -999, -999, -999, -999, -999, -999, -999, -999),
 ('AL011950', '               ABLE', datetime.date(1950, 8, 13), '0', '  ', ' TS', '20.0', '-60.0', 50, -999, -999, -999, -999, -999, -999, -999, -999, -999, -999, -999, -999, -999)]

### Adicionar países aos furacões

In [220]:
import reverse_geocode

# Encontra os países
def country_finder(coordinate_tuples):
    countries = []
    
    for coord_tuple in coordinate_tuples:
        coordinates = [coord_tuple]
        data = reverse_geocode.search(coordinates)
        country = data[0]['country']
        countries.append(country)
    
    return countries

In [221]:
%%sql
lat_long <<
SELECT latitude, longitude FROM
HURRICANE_RAW;

 * postgresql://postgres:***@localhost:5455/furacaodw
75242 rows affected.
Returning data to local variable lat_long

In [222]:
lat_long = [(float(el[0]), float(el[1])) for el in lat_long]

In [223]:
from collections import Counter

hur_countries = country_finder(lat_long)
count = Counter(hur_countries)
count

Counter({'Mexico': 23240,
         'United States': 15870,
         'Bermuda': 5371,
         'Canada': 3558,
         'Portugal': 2959,
         'Bahamas': 2923,
         'Cape Verde': 2895,
         'Barbados': 1758,
         'French Guiana': 1576,
         'Cuba': 1488,
         'Antigua and Barbuda': 1421,
         'Guadeloupe': 1107,
         'Honduras': 896,
         'Turks and Caicos Islands': 832,
         'Colombia': 679,
         'Cayman Islands': 637,
         'Dominican Republic': 621,
         'Jamaica': 614,
         'Anguilla': 604,
         'Puerto Rico': 571,
         'Saint Pierre and Miquelon': 553,
         'Kiribati': 393,
         'Greenland': 381,
         'Virgin Islands, British': 369,
         'Marshall Islands': 363,
         'Haiti': 298,
         'Guatemala': 239,
         'Iceland': 231,
         'Belize': 223,
         'Bonaire, Saint Eustatius and Saba': 184,
         'Nicaragua': 180,
         'Virgin Islands, U.S.': 161,
         'Ireland': 158,
         'Venezuela': 144,
         'Panama': 133,
         'French Polynesia': 121,
         'Aruba': 115,
         'Senegal': 114,
         'Martinique': 97,
         'Grenada': 94,
         'Brazil': 81,
         'Spain': 79,
         'Saint Vincent and the Grenadines': 77,
         'Dominica': 67,
         'El Salvador': 65,
         'Saint Lucia': 57,
         'Trinidad and Tobago': 49,
         'Saint Kitts and Nevis': 48,
         'United Kingdom': 45,
         'Russian Federation': 44,
         'Montserrat': 42,
         'Japan': 42,
         'Curacao': 32,
         'Norway': 32,
         'Suriname': 30,
         'Tokelau': 28,
         'Micronesia, Federated States of': 28,
         'Svalbard and Jan Mayen': 25,
         'Costa Rica': 25,
         'Guinea-Bissau': 23,
         'Mauritania': 22,
         'Gambia': 19,
         'Guyana': 18,
         'Faroe Islands': 17,
         'Saint Bartelemey': 17,
         'Northern Mariana Islands': 13,
         'Guam': 9,
         'Philippines': 8,
         'France': 7,
         'Sint Maarten': 6,
         'Morocco': 5,
         'Guinea': 4,
         'Netherlands': 2,
         'Saint Martin': 2,
         'Denmark': 1,
         'Algeria': 1,
         'Guernsey': 1})

In [224]:
%%sql
ALTER TABLE HURRICANE_RAW 
ADD COLUMN COUNTRY VARCHAR(255)

 * postgresql://postgres:***@localhost:5455/furacaodw
Done.

[]

In [225]:
%%sql
SELECT * FROM HURRICANE_RAW LIMIT 5;

 * postgresql://postgres:***@localhost:5455/furacaodw
5 rows affected.

[('AL011950', '               ABLE', datetime.date(1950, 8, 12), '0', '  ', ' TS', '17.1', '-55.5', 35, -999, -999, -999, -999, -999, -999, -999, -999, -999, -999, -999, -999, -999, None),
 ('AL011950', '               ABLE', datetime.date(1950, 8, 12), '600', '  ', ' TS', '17.7', '-56.3', 40, -999, -999, -999, -999, -999, -999, -999, -999, -999, -999, -999, -999, -999, None),
 ('AL011950', '               ABLE', datetime.date(1950, 8, 12), '1200', '  ', ' TS', '18.2', '-57.4', 45, -999, -999, -999, -999, -999, -999, -999, -999, -999, -999, -999, -999, -999, None),
 ('AL011950', '               ABLE', datetime.date(1950, 8, 12), '1800', '  ', ' TS', '19.0', '-58.6', 50, -999, -999, -999, -999, -999, -999, -999, -999, -999, -999, -999, -999, -999, None),
 ('AL011950', '               ABLE', datetime.date(1950, 8, 13), '0', '  ', ' TS', '20.0', '-60.0', 50, -999, -999, -999, -999, -999, -999, -999, -999, -999, -999, -999, -999, -999, None)]

In [226]:
query = """
INSERT INTO HURRICANE_RAW (country)
VALUES ("{}"); """

with engine.connect() as connection:
    for country in hur_countries:
        result = connection.execute(text(query.format(country)))
    connection.commit()

ProgrammingError: (psycopg2.errors.UndefinedColumn) column "Barbados" does not exist
LINE 3: VALUES ("Barbados");
                ^

[SQL:
INSERT INTO HURRICANE_RAW (country)
VALUES ("Barbados"); ]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [ ]:
Session = sessionmaker(bind=engine)
session = Session()

# Update the new column with values from the list
for index, value in enumerate(new_column_values):
    record = session.query(YourTable).filter_by(id=index + 1).first()  # Assuming 'id' is your primary key
    if record:
        record.new_column = value

# Commit the changes
session.commit()

# Close the session
session.close()